app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT * FROM "flights"

  def show
      @flight = Flight.find(params[:id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 980190962)

  def edit
    @flight = Flight.find(params[:id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 980190962)

  def create
   @flight = Flight.new(params[:flight])

   session[:test_version]? version= 'multiple choice' : version='single choice'
   @survey = SurveyUser.new(:source=>session[:source], :test_version=>version)
	@survey.save

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("created_at", "prebook_date", "updated_at", "from_code", "from_date", "boughtFlag", "to_code", "to_date") VALUES('2010-07-13 07:07:31', '2010-07-13 07:02:00', '2010-07-13 07:07:31', '', '2010-07-13 07:01:00', NULL, '', '2010-07-13 07:02:00')

  def update
    @flight = Flight.find(params[:id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 980190962)

  def destroy
    @flight = Flight.find(params[:id])
    @flight.destroy
---
SELECT * FROM "flights" WHERE ("flights"."id" = 980190962)
DELETE FROM "flights" WHERE "id" = 980190962