app/controllers/survey_users_controller.rb

  def index
    @survey_users = SurveyUser.all
---
SELECT * FROM "survey_users"

  def show
    @survey_user = SurveyUser.find(params[:id])
---
SELECT * FROM "survey_users" WHERE ("survey_users"."id" = 980190962)

  def edit
    @survey_user = SurveyUser.find(params[:id])
---
SELECT * FROM "survey_users" WHERE ("survey_users"."id" = 980190962)

  def create
    @survey_user = SurveyUser.new(params[:survey_user])


    respond_to do |format|
      if @survey_user.save
---
INSERT INTO "survey_users" ("contact_no", "created_at", "company_policy", "book_same_day_long", "book_travel", "book_same_day", "why_wait", "updated_at", "contact", "book_travel_long", "resources", "reason_book", "problem_short", "feedback", "problem_long") VALUES(NULL, '2010-07-18 20:34:57', NULL, NULL, NULL, NULL, NULL, '2010-07-18 20:34:57', NULL, NULL, NULL, NULL, NULL, NULL, NULL)

  def update
    @survey_user = SurveyUser.find(params[:id])
---
SELECT * FROM "survey_users" WHERE ("survey_users"."id" = 980190962)

  def destroy
    @survey_user = SurveyUser.find(params[:id])
    @survey_user.destroy
---
SELECT * FROM "survey_users" WHERE ("survey_users"."id" = 980190962)
DELETE FROM "survey_users" WHERE "id" = 980190962