app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "lname", "fname", "test_button_id", "email") VALUES('2010-07-18 20:34:57', '2010-07-18 20:34:57', NULL, NULL, NULL, NULL)

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 980190962)